<details><summary>Digger run report at 2026-03-23 21:54:30 (UTC)</summary>
      <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.alb_controller.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::659474314285:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.alb_controller.aws_iam_role.alb_controller will be updated in-place
  ~ resource "aws_iam_role" "alb_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::659474314285:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "cknight17-dev-alb-controller"
        name                  = "cknight17-dev-alb-controller"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.dns.data.aws_lb.ingress will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lb" "ingress" {
      + access_logs                                                  = (known after apply)
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = (known after apply)
      + connection_logs                                              = (known after apply)
      + customer_owned_ipv4_pool                                     = (known after apply)
      + desync_mitigation_mode                                       = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = (known after apply)
      + drop_invalid_header_fields                                   = (known after apply)
      + enable_cross_zone_load_balancing                             = (known after apply)
      + enable_deletion_protection                                   = (known after apply)
      + enable_http2                                                 = (known after apply)
      + enable_tls_version_and_cipher_suite_headers                  = (known after apply)
      + enable_waf_fail_open                                         = (known after apply)
      + enable_xff_client_port                                       = (known after apply)
      + enable_zonal_shift                                           = (known after apply)
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = (known after apply)
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + ipam_pools                                                   = (known after apply)
      + load_balancer_type                                           = (known after apply)
      + name                                                         = (known after apply)
      + preserve_host_header                                         = (known after apply)
      + security_groups                                              = (known after apply)
      + subnet_mapping                                               = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "elbv2.k8s.aws/cluster"    = "cknight17-dev"
          + "ingress.k8s.aws/resource" = "LoadBalancer"
          + "ingress.k8s.aws/stack"    = "knighttechnology.net"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = (known after apply)
      + zone_id                                                      = (known after apply)
    }

  # module.dns.aws_route53_record.argocd will be updated in-place
  ~ resource "aws_route53_record" "argocd" {
        id                               = "Z034200010RZYNQN1FO5_argocd.knighttechnology.net_A"
        name                             = "argocd.knighttechnology.net"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "k8s-knighttechnologyn-750b95d44d-271848344.us-east-1.elb.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z35SXDOTRQ7X7K" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.dns.aws_route53_record.demo will be updated in-place
  ~ resource "aws_route53_record" "demo" {
        id                               = "Z034200010RZYNQN1FO5_demo.knighttechnology.net_A"
        name                             = "demo.knighttechnology.net"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "k8s-knighttechnologyn-750b95d44d-271848344.us-east-1.elb.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z35SXDOTRQ7X7K" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.aws_eks_node_group.default will be updated in-place
  ~ resource "aws_eks_node_group" "default" {
        id                     = "cknight17-dev:cknight17-dev-default"
        tags                   = {
            "Name" = "cknight17-dev-default-node"
        }
      ~ version                = "1.31" -> "1.32"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details><summary>Terraform plan validation check (dev)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


Terraform plan summary
| CHANGE |                      RESOURCE                       |
|--------|-----------------------------------------------------|
| update | `module.alb_controller.aws_iam_role.alb_controller` |
|        | `module.dns.aws_route53_record.argocd`              |
|        | `module.dns.aws_route53_record.demo`                |
|        | `module.eks.aws_eks_node_group.default`             |


</details>